Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_GTM_TOM_3_Phase_Inverter_PWM_2/Libraries/Infra/Sfr/TC38x/IfxCan_reg.h
/** \brief 644, Protocol Status Register 1 */
#define CAN0_N1_PSR /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_PSR*)0xF0208644u)
/** Alias (User Manual Name) for CAN0_N1_PSR.
* To use register names with standard convension, please use CAN0_N1_PSR.
*/
#define CAN0_PSR1 (CAN0_N1_PSR)

/** \brief 648, Transmitter Delay Compensation Register 1 */
#define CAN0_N1_TDCR /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TDCR*)0xF0208648u)
/** Alias (User Manual Name) for CAN0_N1_TDCR.
* To use register names with standard convension, please use CAN0_N1_TDCR.
*/
#define CAN0_TDCR1 (CAN0_N1_TDCR)

/** \brief 650, Interrupt Register 1 */
#define CAN0_N1_IR /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_IR*)0xF0208650u)
/** Alias (User Manual Name) for CAN0_N1_IR.
* To use register names with standard convension, please use CAN0_N1_IR.
*/
#define CAN0_IR1 (CAN0_N1_IR)

/** \brief 654, Interrupt Enable 1 */
#define CAN0_N1_IE /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_IE*)0xF0208654u)
/** Alias (User Manual Name) for CAN0_N1_IE.
* To use register names with standard convension, please use CAN0_N1_IE.
*/
#define CAN0_IE1 (CAN0_N1_IE)

/** \brief 680, Global Filter Configuration 1 */
#define CAN0_N1_GFC /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_GFC*)0xF0208680u)
/** Alias (User Manual Name) for CAN0_N1_GFC.
* To use register names with standard convension, please use CAN0_N1_GFC.
*/
#define CAN0_GFC1 (CAN0_N1_GFC)

/** \brief 684, Standard ID Filter Configuration 1 */
#define CAN0_N1_SIDFC /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_SIDFC*)0xF0208684u)
/** Alias (User Manual Name) for CAN0_N1_SIDFC.
* To use register names with standard convension, please use CAN0_N1_SIDFC.
*/
#define CAN0_SIDFC1 (CAN0_N1_SIDFC)

/** \brief 688, Extended ID Filter Configuration 1 */
#define CAN0_N1_XIDFC /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_XIDFC*)0xF0208688u)
/** Alias (User Manual Name) for CAN0_N1_XIDFC.
* To use register names with standard convension, please use CAN0_N1_XIDFC.
*/
#define CAN0_XIDFC1 (CAN0_N1_XIDFC)

/** \brief 690, Extended ID AND Mask 1 */
#define CAN0_N1_XIDAM /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_XIDAM*)0xF0208690u)
/** Alias (User Manual Name) for CAN0_N1_XIDAM.
* To use register names with standard convension, please use CAN0_N1_XIDAM.
*/
#define CAN0_XIDAM1 (CAN0_N1_XIDAM)

/** \brief 694, High Priority Message Status 1 */
#define CAN0_N1_HPMS /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_HPMS*)0xF0208694u)
/** Alias (User Manual Name) for CAN0_N1_HPMS.
* To use register names with standard convension, please use CAN0_N1_HPMS.
*/
#define CAN0_HPMS1 (CAN0_N1_HPMS)

/** \brief 698, New Data 1 1 */
#define CAN0_N1_NDAT1 /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_NDAT1*)0xF0208698u)
/** Alias (User Manual Name) for CAN0_N1_NDAT1.
* To use register names with standard convension, please use CAN0_N1_NDAT1.
*/
#define CAN0_NDAT11 (CAN0_N1_NDAT1)

/** \brief 69C, New Data 2 1 */
#define CAN0_N1_NDAT2 /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_NDAT2*)0xF020869Cu)
/** Alias (User Manual Name) for CAN0_N1_NDAT2.
* To use register names with standard convension, please use CAN0_N1_NDAT2.
*/
#define CAN0_NDAT21 (CAN0_N1_NDAT2)

/** \brief 6A0, Rx FIFO 0 Configuration 1 */
#define CAN0_N1_RX_F0C /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_RX_F0C*)0xF02086A0u)
/** Alias (User Manual Name) for CAN0_N1_RX_F0C.
* To use register names with standard convension, please use CAN0_N1_RX_F0C.
*/
#define CAN0_RXF0C1 (CAN0_N1_RX_F0C)

/** \brief 6A4, Rx FIFO 0 Status 1 */
#define CAN0_N1_RX_F0S /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_RX_F0S*)0xF02086A4u)
/** Alias (User Manual Name) for CAN0_N1_RX_F0S.
* To use register names with standard convension, please use CAN0_N1_RX_F0S.
*/
#define CAN0_RXF0S1 (CAN0_N1_RX_F0S)

/** \brief 6A8, Rx FIFO 0 Acknowledge 1 */
#define CAN0_N1_RX_F0A /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_RX_F0A*)0xF02086A8u)
/** Alias (User Manual Name) for CAN0_N1_RX_F0A.
* To use register names with standard convension, please use CAN0_N1_RX_F0A.
*/
#define CAN0_RXF0A1 (CAN0_N1_RX_F0A)

/** \brief 6AC, Rx Buffer Configuration 1 */
#define CAN0_N1_RX_BC /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_RX_BC*)0xF02086ACu)
/** Alias (User Manual Name) for CAN0_N1_RX_BC.
* To use register names with standard convension, please use CAN0_N1_RX_BC.
*/
#define CAN0_RXBC1 (CAN0_N1_RX_BC)

/** \brief 6B0, Rx FIFO 1 Configuration 1 */
#define CAN0_N1_RX_F1C /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_RX_F1C*)0xF02086B0u)
/** Alias (User Manual Name) for CAN0_N1_RX_F1C.
* To use register names with standard convension, please use CAN0_N1_RX_F1C.
*/
#define CAN0_RXF1C1 (CAN0_N1_RX_F1C)

/** \brief 6B4, Rx FIFO 1 Status 1 */
#define CAN0_N1_RX_F1S /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_RX_F1S*)0xF02086B4u)
/** Alias (User Manual Name) for CAN0_N1_RX_F1S.
* To use register names with standard convension, please use CAN0_N1_RX_F1S.
*/
#define CAN0_RXF1S1 (CAN0_N1_RX_F1S)

/** \brief 6B8, Rx FIFO 1 Acknowledge 1 */
#define CAN0_N1_RX_F1A /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_RX_F1A*)0xF02086B8u)
/** Alias (User Manual Name) for CAN0_N1_RX_F1A.
* To use register names with standard convension, please use CAN0_N1_RX_F1A.
*/
#define CAN0_RXF1A1 (CAN0_N1_RX_F1A)

/** \brief 6BC, Rx Buffer/FIFO Element Size Configuration 1 */
#define CAN0_N1_RX_ESC /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_RX_ESC*)0xF02086BCu)
/** Alias (User Manual Name) for CAN0_N1_RX_ESC.
* To use register names with standard convension, please use CAN0_N1_RX_ESC.
*/
#define CAN0_RXESC1 (CAN0_N1_RX_ESC)

/** \brief 6C0, Tx Buffer Configuration 1 */
#define CAN0_N1_TX_BC /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TX_BC*)0xF02086C0u)
/** Alias (User Manual Name) for CAN0_N1_TX_BC.
* To use register names with standard convension, please use CAN0_N1_TX_BC.
*/
#define CAN0_TXBC1 (CAN0_N1_TX_BC)

/** \brief 6C4, Tx FIFO/Queue Status 1 */
#define CAN0_N1_TX_FQS /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TX_FQS*)0xF02086C4u)
/** Alias (User Manual Name) for CAN0_N1_TX_FQS.
* To use register names with standard convension, please use CAN0_N1_TX_FQS.
*/
#define CAN0_TXFQS1 (CAN0_N1_TX_FQS)

/** \brief 6C8, Tx Buffer Element Size Configuration 1 */
#define CAN0_N1_TX_ESC /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TX_ESC*)0xF02086C8u)
/** Alias (User Manual Name) for CAN0_N1_TX_ESC.
* To use register names with standard convension, please use CAN0_N1_TX_ESC.
*/
#define CAN0_TXESC1 (CAN0_N1_TX_ESC)

