Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_GTM_TOM_3_Phase_Inverter_PWM_2/Libraries/Infra/Sfr/TC38x/IfxCan_reg.h
/** \brief 22C, Timeout Counter Value 0 */
#define CAN2_N0_TOCV /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TOCV*)0xF022822Cu)
/** Alias (User Manual Name) for CAN2_N0_TOCV.
* To use register names with standard convension, please use CAN2_N0_TOCV.
*/
#define CAN2_TOCV0 (CAN2_N0_TOCV)

/** \brief 240, Error Counter Register 0 */
#define CAN2_N0_ECR /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_ECR*)0xF0228240u)
/** Alias (User Manual Name) for CAN2_N0_ECR.
* To use register names with standard convension, please use CAN2_N0_ECR.
*/
#define CAN2_ECR0 (CAN2_N0_ECR)

/** \brief 244, Protocol Status Register 0 */
#define CAN2_N0_PSR /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_PSR*)0xF0228244u)
/** Alias (User Manual Name) for CAN2_N0_PSR.
* To use register names with standard convension, please use CAN2_N0_PSR.
*/
#define CAN2_PSR0 (CAN2_N0_PSR)

/** \brief 248, Transmitter Delay Compensation Register 0 */
#define CAN2_N0_TDCR /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TDCR*)0xF0228248u)
/** Alias (User Manual Name) for CAN2_N0_TDCR.
* To use register names with standard convension, please use CAN2_N0_TDCR.
*/
#define CAN2_TDCR0 (CAN2_N0_TDCR)

/** \brief 250, Interrupt Register 0 */
#define CAN2_N0_IR /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_IR*)0xF0228250u)
/** Alias (User Manual Name) for CAN2_N0_IR.
* To use register names with standard convension, please use CAN2_N0_IR.
*/
#define CAN2_IR0 (CAN2_N0_IR)

/** \brief 254, Interrupt Enable 0 */
#define CAN2_N0_IE /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_IE*)0xF0228254u)
/** Alias (User Manual Name) for CAN2_N0_IE.
* To use register names with standard convension, please use CAN2_N0_IE.
*/
#define CAN2_IE0 (CAN2_N0_IE)

/** \brief 280, Global Filter Configuration 0 */
#define CAN2_N0_GFC /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_GFC*)0xF0228280u)
/** Alias (User Manual Name) for CAN2_N0_GFC.
* To use register names with standard convension, please use CAN2_N0_GFC.
*/
#define CAN2_GFC0 (CAN2_N0_GFC)

/** \brief 284, Standard ID Filter Configuration 0 */
#define CAN2_N0_SIDFC /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_SIDFC*)0xF0228284u)
/** Alias (User Manual Name) for CAN2_N0_SIDFC.
* To use register names with standard convension, please use CAN2_N0_SIDFC.
*/
#define CAN2_SIDFC0 (CAN2_N0_SIDFC)

/** \brief 288, Extended ID Filter Configuration 0 */
#define CAN2_N0_XIDFC /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_XIDFC*)0xF0228288u)
/** Alias (User Manual Name) for CAN2_N0_XIDFC.
* To use register names with standard convension, please use CAN2_N0_XIDFC.
*/
#define CAN2_XIDFC0 (CAN2_N0_XIDFC)

/** \brief 290, Extended ID AND Mask 0 */
#define CAN2_N0_XIDAM /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_XIDAM*)0xF0228290u)
/** Alias (User Manual Name) for CAN2_N0_XIDAM.
* To use register names with standard convension, please use CAN2_N0_XIDAM.
*/
#define CAN2_XIDAM0 (CAN2_N0_XIDAM)

/** \brief 294, High Priority Message Status 0 */
#define CAN2_N0_HPMS /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_HPMS*)0xF0228294u)
/** Alias (User Manual Name) for CAN2_N0_HPMS.
* To use register names with standard convension, please use CAN2_N0_HPMS.
*/
#define CAN2_HPMS0 (CAN2_N0_HPMS)

/** \brief 298, New Data 1 0 */
#define CAN2_N0_NDAT1 /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_NDAT1*)0xF0228298u)
/** Alias (User Manual Name) for CAN2_N0_NDAT1.
* To use register names with standard convension, please use CAN2_N0_NDAT1.
*/
#define CAN2_NDAT10 (CAN2_N0_NDAT1)

/** \brief 29C, New Data 2 0 */
#define CAN2_N0_NDAT2 /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_NDAT2*)0xF022829Cu)
/** Alias (User Manual Name) for CAN2_N0_NDAT2.
* To use register names with standard convension, please use CAN2_N0_NDAT2.
*/
#define CAN2_NDAT20 (CAN2_N0_NDAT2)

/** \brief 2A0, Rx FIFO 0 Configuration 0 */
#define CAN2_N0_RX_F0C /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_RX_F0C*)0xF02282A0u)
/** Alias (User Manual Name) for CAN2_N0_RX_F0C.
* To use register names with standard convension, please use CAN2_N0_RX_F0C.
*/
#define CAN2_RXF0C0 (CAN2_N0_RX_F0C)

/** \brief 2A4, Rx FIFO 0 Status 0 */
#define CAN2_N0_RX_F0S /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_RX_F0S*)0xF02282A4u)
/** Alias (User Manual Name) for CAN2_N0_RX_F0S.
* To use register names with standard convension, please use CAN2_N0_RX_F0S.
*/
#define CAN2_RXF0S0 (CAN2_N0_RX_F0S)

/** \brief 2A8, Rx FIFO 0 Acknowledge 0 */
#define CAN2_N0_RX_F0A /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_RX_F0A*)0xF02282A8u)
/** Alias (User Manual Name) for CAN2_N0_RX_F0A.
* To use register names with standard convension, please use CAN2_N0_RX_F0A.
*/
#define CAN2_RXF0A0 (CAN2_N0_RX_F0A)

/** \brief 2AC, Rx Buffer Configuration 0 */
#define CAN2_N0_RX_BC /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_RX_BC*)0xF02282ACu)
/** Alias (User Manual Name) for CAN2_N0_RX_BC.
* To use register names with standard convension, please use CAN2_N0_RX_BC.
*/
#define CAN2_RXBC0 (CAN2_N0_RX_BC)

/** \brief 2B0, Rx FIFO 1 Configuration 0 */
#define CAN2_N0_RX_F1C /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_RX_F1C*)0xF02282B0u)
/** Alias (User Manual Name) for CAN2_N0_RX_F1C.
* To use register names with standard convension, please use CAN2_N0_RX_F1C.
*/
#define CAN2_RXF1C0 (CAN2_N0_RX_F1C)

/** \brief 2B4, Rx FIFO 1 Status 0 */
#define CAN2_N0_RX_F1S /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_RX_F1S*)0xF02282B4u)
/** Alias (User Manual Name) for CAN2_N0_RX_F1S.
* To use register names with standard convension, please use CAN2_N0_RX_F1S.
*/
#define CAN2_RXF1S0 (CAN2_N0_RX_F1S)

/** \brief 2B8, Rx FIFO 1 Acknowledge 0 */
#define CAN2_N0_RX_F1A /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_RX_F1A*)0xF02282B8u)
/** Alias (User Manual Name) for CAN2_N0_RX_F1A.
* To use register names with standard convension, please use CAN2_N0_RX_F1A.
*/
#define CAN2_RXF1A0 (CAN2_N0_RX_F1A)

/** \brief 2BC, Rx Buffer/FIFO Element Size Configuration 0 */
#define CAN2_N0_RX_ESC /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_RX_ESC*)0xF02282BCu)
/** Alias (User Manual Name) for CAN2_N0_RX_ESC.
* To use register names with standard convension, please use CAN2_N0_RX_ESC.
*/
#define CAN2_RXESC0 (CAN2_N0_RX_ESC)

/** \brief 2C0, Tx Buffer Configuration 0 */
#define CAN2_N0_TX_BC /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TX_BC*)0xF02282C0u)
/** Alias (User Manual Name) for CAN2_N0_TX_BC.
* To use register names with standard convension, please use CAN2_N0_TX_BC.
*/
#define CAN2_TXBC0 (CAN2_N0_TX_BC)

/** \brief 2C4, Tx FIFO/Queue Status 0 */
#define CAN2_N0_TX_FQS /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TX_FQS*)0xF02282C4u)
/** Alias (User Manual Name) for CAN2_N0_TX_FQS.
* To use register names with standard convension, please use CAN2_N0_TX_FQS.
*/
#define CAN2_TXFQS0 (CAN2_N0_TX_FQS)

/** \brief 2C8, Tx Buffer Element Size Configuration 0 */
#define CAN2_N0_TX_ESC /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TX_ESC*)0xF02282C8u)
/** Alias (User Manual Name) for CAN2_N0_TX_ESC.
* To use register names with standard convension, please use CAN2_N0_TX_ESC.
*/
#define CAN2_TXESC0 (CAN2_N0_TX_ESC)

/** \brief 2CC, Tx Buffer Request Pending 0 */
#define CAN2_N0_TX_BRP /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TX_BRP*)0xF02282CCu)
/** Alias (User Manual Name) for CAN2_N0_TX_BRP.
* To use register names with standard convension, please use CAN2_N0_TX_BRP.
*/
#define CAN2_TXBRP0 (CAN2_N0_TX_BRP)

/** \brief 2D0, Tx Buffer Add Request 0 */
#define CAN2_N0_TX_BAR /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TX_BAR*)0xF02282D0u)
/** Alias (User Manual Name) for CAN2_N0_TX_BAR.
* To use register names with standard convension, please use CAN2_N0_TX_BAR.
*/
#define CAN2_TXBAR0 (CAN2_N0_TX_BAR)

/** \brief 2D4, Tx Buffer Cancellation Request 0 */
#define CAN2_N0_TX_BCR /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TX_BCR*)0xF02282D4u)
/** Alias (User Manual Name) for CAN2_N0_TX_BCR.
* To use register names with standard convension, please use CAN2_N0_TX_BCR.
*/
#define CAN2_TXBCR0 (CAN2_N0_TX_BCR)

/** \brief 2D8, Tx Buffer Transmission Occurred 0 */
#define CAN2_N0_TX_BTO /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TX_BTO*)0xF02282D8u)
/** Alias (User Manual Name) for CAN2_N0_TX_BTO.
* To use register names with standard convension, please use CAN2_N0_TX_BTO.
*/
#define CAN2_TXBTO0 (CAN2_N0_TX_BTO)

/** \brief 2DC, Tx Buffer Cancellation Finished 0 */
#define CAN2_N0_TX_BCF /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TX_BCF*)0xF02282DCu)
/** Alias (User Manual Name) for CAN2_N0_TX_BCF.
* To use register names with standard convension, please use CAN2_N0_TX_BCF.
*/
#define CAN2_TXBCF0 (CAN2_N0_TX_BCF)

/** \brief 2E0, Tx Buffer Transmission Interrupt Enable 0 */
#define CAN2_N0_TX_BTIE /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TX_BTIE*)0xF02282E0u)
/** Alias (User Manual Name) for CAN2_N0_TX_BTIE.
* To use register names with standard convension, please use CAN2_N0_TX_BTIE.
*/
#define CAN2_TXBTIE0 (CAN2_N0_TX_BTIE)

/** \brief 2E4, Tx Buffer Cancellation Finished Interrupt Enable 0 */
#define CAN2_N0_TX_BCIE /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TX_BCIE*)0xF02282E4u)
/** Alias (User Manual Name) for CAN2_N0_TX_BCIE.
* To use register names with standard convension, please use CAN2_N0_TX_BCIE.
*/
#define CAN2_TXBCIE0 (CAN2_N0_TX_BCIE)

/** \brief 2F0, Tx Event FIFO Configuration 0 */
#define CAN2_N0_TX_EFC /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TX_EFC*)0xF02282F0u)
/** Alias (User Manual Name) for CAN2_N0_TX_EFC.
* To use register names with standard convension, please use CAN2_N0_TX_EFC.
*/
#define CAN2_TXEFC0 (CAN2_N0_TX_EFC)

